Revit 2027 API
EnergyAnalysisZone.HeatingAirTemperature Property
 The cooling air temperature in unit Kelvin (K).
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double HeatingAirTemperature { get; }
Public ReadOnly Property HeatingAirTemperature As Double
	Get
public:
property double HeatingAirTemperature {
	double get ();
}
member HeatingAirTemperature : float with get
Property Value
Double
See Also
Reference
EnergyAnalysisZone Class
Autodesk.Revit.DB.Analysis Namespace